//
// Created by 19254 on 24-8-8.
//
#include "HYGUI/Paragraph.h"
#include "HYGUI/HYGUI.h"

using namespace HYGUI;

HYGUI::HYString tste = R"(投稿的主人公是一名工作5年的后端开发工程师，最近2年用Golang，之前其他语言。去年春节前被裁员了，各种心酸史，好愁人啊。
刚开始找的特别费劲，简历已读不回，也不知道怎么做准备更好。在撞了很多南墙之后，终于摸到了门道，开始能约到面试了。
然后更难顶的事情发生了：经过各种努力和约面，我拿到了北京的两个offer，但是深圳一个都没拿到，我自己更倾向在深圳工作的，实在实在没办法才会去北京。
深圳这边的工作很卷，越面试考察越难，刚开始那几家我还扛得住，主要是八股和算法，后来不少公司更多的是考察各种各样的场景题，甚至还有公司问我如果让我带一个5~10人小团队做项目会考虑哪些事情？
我真是服气了，我只是一个想找20K工作的gopher程序员，要求已经这么高了吗？太卷了。。。。
在各种学习各种突击、踏踏实实提高自己之后，目前已经成功上岸深圳的公司了，在这里真心分享一个靠谱的经验：别想着速成，踏踏实实的提高自己才是王道。
秉承着好人有好报的原则：我授权阳哥把我最近面试了十几家公司，将近30场面试的面经和经验都分享出来，希望对大家有帮助，希望阳哥的粉丝们都能顺利上岸！把我这份好运传递下去！！！

下面开始秀一下最新面经：

北京外包-掌阅科技
面试题：

自我介绍
介绍一下你参与的模块的业务以及架构设计   交易流程
说一下微信支付流程
介绍一下你最了解的业务的技术实现   做了哪些业务封装？解决了哪些问题？
mongodb的集合是什么？文档是什么？
mongodb的底层数据结构是什么？怎么实现的？怎么存储的？投稿的主人公是一名工作5年的后端开发工程师，最近2年用Golang，之前其他语言。去年春节前被裁员了，各种心酸史，好愁人啊。
刚开始找的特别费劲，简历已读不回，也不知道怎么做准备更好。在撞了很多南墙之后，终于摸到了门道，开始能约到面试了。
然后更难顶的事情发生了：经过各种努力和约面，我拿到了北京的两个offer，但是深圳一个都没拿到，我自己更倾向在深圳工作的，实在实在没办法才会去北京。
深圳这边的工作很卷，越面试考察越难，刚开始那几家我还扛得住，主要是八股和算法，后来不少公司更多的是考察各种各样的场景题，甚至还有公司问我如果让我带一个5~10人小团队做项目会考虑哪些事情？
我真是服气了，我只是一个想找20K工作的gopher程序员，要求已经这么高了吗？太卷了。。。。
在各种学习各种突击、踏踏实实提高自己之后，目前已经成功上岸深圳的公司了，在这里真心分享一个靠谱的经验：别想着速成，踏踏实实的提高自己才是王道。
秉承着好人有好报的原则：我授权阳哥把我最近面试了十几家公司，将近30场面试的面经和经验都分享出来，希望对大家有帮助，希望阳哥的粉丝们都能顺利上岸！把我这份好运传递下去！！！

下面开始秀一下最新面经：

北京外包-掌阅科技
面试题：

自我介绍
介绍一下你参与的模块的业务以及架构设计   交易流程
说一下微信支付流程
介绍一下你最了解的业务的技术实现   做了哪些业务封装？解决了哪些问题？
mongodb的集合是什么？文档是什么？
mongodb的底层数据结构是什么？怎么实现的？怎么存储的？投稿的主人公是一名工作5年的后端开发工程师，最近2年用Golang，之前其他语言。去年春节前被裁员了，各种心酸史，好愁人啊。
刚开始找的特别费劲，简历已读不回，也不知道怎么做准备更好。在撞了很多南墙之后，终于摸到了门道，开始能约到面试了。
然后更难顶的事情发生了：经过各种努力和约面，我拿到了北京的两个offer，但是深圳一个都没拿到，我自己更倾向在深圳工作的，实在实在没办法才会去北京。
深圳这边的工作很卷，越面试考察越难，刚开始那几家我还扛得住，主要是八股和算法，后来不少公司更多的是考察各种各样的场景题，甚至还有公司问我如果让我带一个5~10人小团队做项目会考虑哪些事情？
我真是服气了，我只是一个想找20K工作的gopher程序员，要求已经这么高了吗？太卷了。。。。
在各种学习各种突击、踏踏实实提高自己之后，目前已经成功上岸深圳的公司了，在这里真心分享一个靠谱的经验：别想着速成，踏踏实实的提高自己才是王道。
秉承着好人有好报的原则：我授权阳哥把我最近面试了十几家公司，将近30场面试的面经和经验都分享出来，希望对大家有帮助，希望阳哥的粉丝们都能顺利上岸！把我这份好运传递下去！！！

下面开始秀一下最新面经：

北京外包-掌阅科技
面试题：

自我介绍
介绍一下你参与的模块的业务以及架构设计   交易流程
说一下微信支付流程
介绍一下你最了解的业务的技术实现   做了哪些业务封装？解决了哪些问题？
mongodb的集合是什么？文档是什么？
mongodb的底层数据结构是什么？怎么实现的？怎么存储的？投稿的主人公是一名工作5年的后端开发工程师，最近2年用Golang，之前其他语言。去年春节前被裁员了，各种心酸史，好愁人啊。
刚开始找的特别费劲，简历已读不回，也不知道怎么做准备更好。在撞了很多南墙之后，终于摸到了门道，开始能约到面试了。
然后更难顶的事情发生了：经过各种努力和约面，我拿到了北京的两个offer，但是深圳一个都没拿到，我自己更倾向在深圳工作的，实在实在没办法才会去北京。
深圳这边的工作很卷，越面试考察越难，刚开始那几家我还扛得住，主要是八股和算法，后来不少公司更多的是考察各种各样的场景题，甚至还有公司问我如果让我带一个5~10人小团队做项目会考虑哪些事情？
我真是服气了，我只是一个想找20K工作的gopher程序员，要求已经这么高了吗？太卷了。。。。
在各种学习各种突击、踏踏实实提高自己之后，目前已经成功上岸深圳的公司了，在这里真心分享一个靠谱的经验：别想着速成，踏踏实实的提高自己才是王道。
秉承着好人有好报的原则：我授权阳哥把我最近面试了十几家公司，将近30场面试的面经和经验都分享出来，希望对大家有帮助，希望阳哥的粉丝们都能顺利上岸！把我这份好运传递下去！！！

下面开始秀一下最新面经：

北京外包-掌阅科技
面试题：

自我介绍
介绍一下你参与的模块的业务以及架构设计   交易流程
说一下微信支付流程
介绍一下你最了解的业务的技术实现   做了哪些业务封装？解决了哪些问题？
mongodb的集合是什么？文档是什么？
mongodb的底层数据结构是什么？怎么实现的？怎么存储的？投稿的主人公是一名工作5年的后端开发工程师，最近2年用Golang，之前其他语言。去年春节前被裁员了，各种心酸史，好愁人啊。
刚开始找的特别费劲，简历已读不回，也不知道怎么做准备更好。在撞了很多南墙之后，终于摸到了门道，开始能约到面试了。
然后更难顶的事情发生了：经过各种努力和约面，我拿到了北京的两个offer，但是深圳一个都没拿到，我自己更倾向在深圳工作的，实在实在没办法才会去北京。
深圳这边的工作很卷，越面试考察越难，刚开始那几家我还扛得住，主要是八股和算法，后来不少公司更多的是考察各种各样的场景题，甚至还有公司问我如果让我带一个5~10人小团队做项目会考虑哪些事情？
我真是服气了，我只是一个想找20K工作的gopher程序员，要求已经这么高了吗？太卷了。。。。
在各种学习各种突击、踏踏实实提高自己之后，目前已经成功上岸深圳的公司了，在这里真心分享一个靠谱的经验：别想着速成，踏踏实实的提高自己才是王道。
秉承着好人有好报的原则：我授权阳哥把我最近面试了十几家公司，将近30场面试的面经和经验都分享出来，希望对大家有帮助，希望阳哥的粉丝们都能顺利上岸！把我这份好运传递下去！！！

下面开始秀一下最新面经：

北京外包-掌阅科技
面试题：

自我介绍
介绍一下你参与的模块的业务以及架构设计   交易流程
说一下微信支付流程
介绍一下你最了解的业务的技术实现   做了哪些业务封装？解决了哪些问题？
mongodb的集合是什么？文档是什么？
mongodb的底层数据结构是什么？怎么实现的？怎么存储的？投稿的主人公是一名工作5年的后端开发工程师，最近2年用Golang，之前其他语言。去年春节前被裁员了，各种心酸史，好愁人啊。
刚开始找的特别费劲，简历已读不回，也不知道怎么做准备更好。在撞了很多南墙之后，终于摸到了门道，开始能约到面试了。
然后更难顶的事情发生了：经过各种努力和约面，我拿到了北京的两个offer，但是深圳一个都没拿到，我自己更倾向在深圳工作的，实在实在没办法才会去北京。
深圳这边的工作很卷，越面试考察越难，刚开始那几家我还扛得住，主要是八股和算法，后来不少公司更多的是考察各种各样的场景题，甚至还有公司问我如果让我带一个5~10人小团队做项目会考虑哪些事情？
我真是服气了，我只是一个想找20K工作的gopher程序员，要求已经这么高了吗？太卷了。。。。
在各种学习各种突击、踏踏实实提高自己之后，目前已经成功上岸深圳的公司了，在这里真心分享一个靠谱的经验：别想着速成，踏踏实实的提高自己才是王道。
秉承着好人有好报的原则：我授权阳哥把我最近面试了十几家公司，将近30场面试的面经和经验都分享出来，希望对大家有帮助，希望阳哥的粉丝们都能顺利上岸！把我这份好运传递下去！！！

下面开始秀一下最新面经：

北京外包-掌阅科技
面试题：

自我介绍
介绍一下你参与的模块的业务以及架构设计   交易流程
说一下微信支付流程
介绍一下你最了解的业务的技术实现   做了哪些业务封装？解决了哪些问题？
mongodb的集合是什么？文档是什么？
mongodb的底层数据结构是什么？怎么实现的？怎么存储的？投稿的主人公是一名工作5年的后端开发工程师，最近2年用Golang，之前其他语言。去年春节前被裁员了，各种心酸史，好愁人啊。
刚开始找的特别费劲，简历已读不回，也不知道怎么做准备更好。在撞了很多南墙之后，终于摸到了门道，开始能约到面试了。
然后更难顶的事情发生了：经过各种努力和约面，我拿到了北京的两个offer，但是深圳一个都没拿到，我自己更倾向在深圳工作的，实在实在没办法才会去北京。
深圳这边的工作很卷，越面试考察越难，刚开始那几家我还扛得住，主要是八股和算法，后来不少公司更多的是考察各种各样的场景题，甚至还有公司问我如果让我带一个5~10人小团队做项目会考虑哪些事情？
我真是服气了，我只是一个想找20K工作的gopher程序员，要求已经这么高了吗？太卷了。。。。
在各种学习各种突击、踏踏实实提高自己之后，目前已经成功上岸深圳的公司了，在这里真心分享一个靠谱的经验：别想着速成，踏踏实实的提高自己才是王道。
秉承着好人有好报的原则：我授权阳哥把我最近面试了十几家公司，将近30场面试的面经和经验都分享出来，希望对大家有帮助，希望阳哥的粉丝们都能顺利上岸！把我这份好运传递下去！！！

下面开始秀一下最新面经：

北京外包-掌阅科技
面试题：

自我介绍
介绍一下你参与的模块的业务以及架构设计   交易流程
说一下微信支付流程
介绍一下你最了解的业务的技术实现   做了哪些业务封装？解决了哪些问题？
mongodb的集合是什么？文档是什么？
mongodb的底层数据结构是什么？怎么实现的？怎么存储的？投稿的主人公是一名工作5年的后端开发工程师，最近2年用Golang，之前其他语言。去年春节前被裁员了，各种心酸史，好愁人啊。
刚开始找的特别费劲，简历已读不回，也不知道怎么做准备更好。在撞了很多南墙之后，终于摸到了门道，开始能约到面试了。
然后更难顶的事情发生了：经过各种努力和约面，我拿到了北京的两个offer，但是深圳一个都没拿到，我自己更倾向在深圳工作的，实在实在没办法才会去北京。
深圳这边的工作很卷，越面试考察越难，刚开始那几家我还扛得住，主要是八股和算法，后来不少公司更多的是考察各种各样的场景题，甚至还有公司问我如果让我带一个5~10人小团队做项目会考虑哪些事情？
我真是服气了，我只是一个想找20K工作的gopher程序员，要求已经这么高了吗？太卷了。。。。
在各种学习各种突击、踏踏实实提高自己之后，目前已经成功上岸深圳的公司了，在这里真心分享一个靠谱的经验：别想着速成，踏踏实实的提高自己才是王道。
秉承着好人有好报的原则：我授权阳哥把我最近面试了十几家公司，将近30场面试的面经和经验都分享出来，希望对大家有帮助，希望阳哥的粉丝们都能顺利上岸！把我这份好运传递下去！！！

下面开始秀一下最新面经：

北京外包-掌阅科技
面试题：

自我介绍
介绍一下你参与的模块的业务以及架构设计   交易流程
说一下微信支付流程
介绍一下你最了解的业务的技术实现   做了哪些业务封装？解决了哪些问题？
mongodb的集合是什么？文档是什么？
mongodb的底层数据结构是什么？怎么实现的？怎么存储的？投稿的主人公是一名工作5年的后端开发工程师，最近2年用Golang，之前其他语言。去年春节前被裁员了，各种心酸史，好愁人啊。
刚开始找的特别费劲，简历已读不回，也不知道怎么做准备更好。在撞了很多南墙之后，终于摸到了门道，开始能约到面试了。
然后更难顶的事情发生了：经过各种努力和约面，我拿到了北京的两个offer，但是深圳一个都没拿到，我自己更倾向在深圳工作的，实在实在没办法才会去北京。
深圳这边的工作很卷，越面试考察越难，刚开始那几家我还扛得住，主要是八股和算法，后来不少公司更多的是考察各种各样的场景题，甚至还有公司问我如果让我带一个5~10人小团队做项目会考虑哪些事情？
我真是服气了，我只是一个想找20K工作的gopher程序员，要求已经这么高了吗？太卷了。。。。
在各种学习各种突击、踏踏实实提高自己之后，目前已经成功上岸深圳的公司了，在这里真心分享一个靠谱的经验：别想着速成，踏踏实实的提高自己才是王道。
秉承着好人有好报的原则：我授权阳哥把我最近面试了十几家公司，将近30场面试的面经和经验都分享出来，希望对大家有帮助，希望阳哥的粉丝们都能顺利上岸！把我这份好运传递下去！！！
🤔🤗😝
下面开始秀一下最新面经：
❤️💕
北京外包-掌阅科技
面试题：
👌😉🥰
自我介绍
介绍一下你参与的模块的业务以及架构设计   交易流程
说一下微信支付流程
介绍一下你最了解的业务的技术实现   做了哪些业务封装？解决了哪些问题？
mongodb的集合是什么？文档是什么？
mongodb的底层数据结构是什么？怎么实现的？怎么存储的？
)";

int main() {
  HYInit(HYGlobalFlag::HYGlobalFlagGraphicDefault);
  auto start = std::chrono::high_resolution_clock::now();
  auto Font = HYFontCreateFromTypeface(HYTypefaceCreateFromDefault());

  HYParagraphBuilderImpl ParagraphBuilderImpl(HYRectf{0, 0, 50, 50},Font);

  ParagraphBuilderImpl.SetAutoWrap(true);
  ParagraphBuilderImpl.AddText(tste);
  ParagraphBuilderImpl.Build();

  auto end = std::chrono::high_resolution_clock::now();
  std::chrono::duration<double, std::milli> duration = end - start;// 使用毫秒作为单位
  std::cout << "Time taken: " << duration.count() << " milliseconds" << std::endl;
  HYExit();
  return 0;
}